app/controllers/places_controller.rb

	def update
		if @place.update(place_params)
---
UPDATE "places" SET "established_at" = $1, "phone_number" = $2, "contact_mail" = $3, "city" = $4, "description" = $5, "updated_at" = $6 WHERE "places"."id" = $7

	def load_categories
		@categories = Category.all.collect {|c| [c.name, c.id]}
---
SELECT "categories".* FROM "categories"