app/views/categories/show.html.erb

SELECT "places".* FROM "places" WHERE "places"."category_id" = $1  [["category_id", 1]]
---

  <% @category.places.each do |place| %> <br/>